bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA8535.xml
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit"/>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                </instance>
            </module>
            <module name="TC8_ASYNC">
                <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                    <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit Async"/>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                    caption="External Interrupts"/>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                    caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                    caption="Fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt 0"/>
            <interrupt index="2" name="INT1" caption="External Interrupt 1"/>
            <interrupt index="3" name="TIMER2_COMP" caption="Timer/Counter2 Compare Match"/>
            <interrupt index="4" name="TIMER2_OVF" caption="Timer/Counter2 Overflow"/>
            <interrupt index="5" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
            <interrupt index="6" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
            <interrupt index="7" name="TIMER1_COMPB" caption="Timer/Counter1 Compare Match B"/>
            <interrupt index="8" name="TIMER1_OVF" caption="Timer/Counter1 Overflow"/>
            <interrupt index="9" name="TIMER0_OVF" caption="Timer/Counter0 Overflow"/>
            <interrupt index="10" name="SPI_STC" caption="SPI Serial Transfer Complete"/>
            <interrupt index="11" name="USART_RX" caption="USART, RX Complete"/>
            <interrupt index="12" name="USART_UDRE" caption="USART Data Register Empty"/>
            <interrupt index="13" name="USART_TX" caption="USART, TX Complete"/>
            <interrupt index="14" name="ADC" caption="ADC Conversion Complete"/>
            <interrupt index="15" name="EE_RDY" caption="EEPROM Ready"/>
            <interrupt index="16" name="ANA_COMP" caption="Analog Comparator"/>
            <interrupt index="17" name="TWI" caption="Two-wire Serial Interface"/>
            <interrupt index="18" name="INT2" caption="External Interrupt Request 2"/>
            <interrupt index="19" name="TIMER0_COMP" caption="TimerCounter0 Compare Match"/>
            <interrupt index="20" name="SPM_RDY" caption="Store Program Memory Read"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x93"/>
                <property name="SIGNATURE2" value="0x08"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="20"/>
                <property name="IspChipErase_pollMethod" value="0"/>
                <property name="IspProgramFlash_mode" value="0x21"/>
                <property name="IspProgramFlash_blockSize" value="64"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x20"/>
                <property name="IspProgramFlash_pollVal1" value="0xFF"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x04"/>
                <property name="IspProgramEeprom_blockSize" value="128"/>
                <property name="IspProgramEeprom_delay" value="20"/>
                <property name="IspProgramEeprom_cmd1" value="0xC0"/>
                <property name="IspProgramEeprom_cmd2" value="0x00"/>
                <property name="IspProgramEeprom_cmd3" value="0xA0"/>
                <property name="IspProgramEeprom_pollVal1" value="0xFF"/>
                <property name="IspProgramEeprom_pollVal2" value="0xFF"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="6"/>
                <property name="PpEnterProgMode_toggleVtg" value="0"/>
                <property name="PpEnterProgMode_powerOffDelay" value="0"/>
                <property name="PpEnterProgMode_resetDelayMs" value="0"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0D"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="10"/>
                <property name="IspChipErase_pollMethod" value="0"/>
                <property name="IspProgramFlash_mode" value="0x21"/>
                <property name="IspProgramFlash_blockSize" value="64"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x20"/>
                <property name="IspProgramFlash_pollVal1" value="0xFF"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x04"/>
                <property name="IspProgramEeprom_blockSize" value="128"/>
                <property name="IspProgramEeprom_delay" value="10"/>
                <property name="IspProgramEeprom_cmd1" value="0xC0"/>
                <property name="IspProgramEeprom_cmd2" value="0x00"/>
                <property name="IspProgramEeprom_cmd3" value="0xA0"/>
                <property name="IspProgramEeprom_pollVal1" value="0xFF"/>
                <property name="IspProgramEeprom_pollVal2" value="0xFF"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="6"/>
                <property name="PpEnterProgMode_toggleVtg" value="0"/>
                <property name="PpEnterProgMode_powerOffDelay" value="0"/>
                <property name="PpEnterProgMode_resetDelayMs" value="0"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0D"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="HIGH" offset="0x01" size="1" initval="0xD9">
                    <bitfield caption="AT90S4434/8535 compatibility mode" mask="0x80" name="S8535C"/>
                    <bitfield caption="Watch-dog Timer always on" mask="0x40" name="WDTON"/>
                    <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x08" name="EESAVE"/>
                    <bitfield caption="Select Boot Size" mask="0x06" name="BOOTSZ" values="ENUM_BOOTSZ"/>
                    <bitfield caption="Boot Reset vector Enabled" mask="0x01" name="BOOTRST"/>
                    <bitfield caption="CKOPT fuse (operation dependent of CKSEL fuses)" mask="0x10" name="CKOPT"/>
                </register>
                <register caption="" name="LOW" offset="0x00" size="1" initval="0xE1">
                    <bitfield caption="Brownout detector trigger level" mask="0x80" name="BODLEVEL"
                              values="ENUM_BODLEVEL"/>
                    <bitfield caption="Brown-out detection enabled" mask="0x40" name="BODEN"/>
                    <bitfield caption="Select Clock Source" mask="0x3F" name="SUT_CKSEL" values="ENUM_SUT_CKSEL"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection at VCC=4.0 V" name="4V0" value="0x00"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x01"/>
            </value-group>
